[
  {"id": 1, "text": "Куди подати заяву на перехід між спеціальностями?", "label": "Administrative"},
  {"id": 2, "text": "Хто сьогодні відповідає за трансляцію конференції в ауд. 12?", "label": "General"},
  {"id": 3, "text": "Чи можна отримати приклад розв'язання задачі з попереднього практичного?", "label": "Homework"},
  {"id": 4, "text": "Останнім часом почуваюся дуже втомленим і нічого не хочу робити, що порадите?", "label": "Mental Health"},
  {"id": 5, "text": "Які документи потрібні для оформлення академічної відпустки?", "label": "Administrative"},
  {"id": 6, "text": "Хто може допомогти з налаштуванням принтера в бібліотеці?", "label": "General"},
  {"id": 7, "text": "Підкажіть, будь ласка, як довести цю інтегральну формулу — не можу зрозуміти крок із заміною змінної.", "label": "Homework"},
  {"id": 8, "text": "Мене лякає кількість завдань і я відчуваю тривогу перед іспитами.", "label": "Mental Health"},
  {"id": 9, "text": "Коли закінчується термін оплати семестрового внеску?", "label": "Administrative"},
  {"id": 10, "text": "Чи буде гуртожиток закритий на вихідні через ремонт?", "label": "General"},
  {"id": 11, "text": "Як правильно оформити список літератури згідно з вимогами викладача?", "label": "Homework"},
  {"id": 12, "text": "Вже тиждень сплю по 4 години і постійно відчуваю паніку — чи є у виші психологічна допомога?", "label": "Mental Health"},
  {"id": 13, "text": "Мені потрібно змінити групу — куди звертатися?", "label": "Administrative"},
  {"id": 14, "text": "Хто організовує екскурсію на підприємство наступного місяця?", "label": "General"},
  {"id": 15, "text": "Чи можна здані домашні завдання завантажити після дедлайну з поясненням?", "label": "Homework"},
  {"id": 16, "text": "Я відчуваю, що втрачаю мотивацію — як знайти сили продовжувати навчання?", "label": "Mental Health"},
  {"id": 17, "text": "Як отримати довідку про навчання для податкової?", "label": "Administrative"},
  {"id": 18, "text": "Де можна знайти розклад консультацій викладачів?", "label": "General"},
  {"id": 19, "text": "Поясніть, будь ласка, як написати SQL-запит для об'єднання трьох таблиць.", "label": "Homework"},
  {"id": 20, "text": "Після карантину важко звикнути до соціальних контактів — відчуваю тривогу в натовпі.", "label": "Mental Health"},
  {"id": 21, "text": "Чи є можливість відстрочити іспит через хворобу?", "label": "Administrative"},
  {"id": 22, "text": "Чи працює кафе на першому поверсі по суботах?", "label": "General"},
  {"id": 23, "text": "Можете перевірити мою лабораторну роботу перед відправкою — чи правильно я вказав одиниці?", "label": "Homework"},
  {"id": 24, "text": "Іноді прокидаюся з тиском у грудях — як звернутися по допомогу у виші?", "label": "Mental Health"},
  {"id": 25, "text": "Де знайти інформацію про стипендії та порядок їх нарахування?", "label": "Administrative"},
  {"id": 26, "text": "Чи буде лекція записана для тих, хто не зміг прийти?", "label": "General"},
  {"id": 27, "text": "Як спростити цей вираз у теорії чисел — є помилка на третьому кроці.", "label": "Homework"},
  {"id": 28, "text": "Я відчуваю постійну втому і не можу зосередитись на навчанні.", "label": "Mental Health"},
  {"id": 29, "text": "Коли видають студентські квитки новоприйнятим?", "label": "Administrative"},
  {"id": 30, "text": "Чи можна принести на пару додаткові матеріали (плакати) для презентації?", "label": "General"},
  {"id": 31, "text": "Потрібна допомога з дебагом кода — підкажіть, чому console.log нічого не показує.", "label": "Homework"},
  {"id": 32, "text": "Після розриву відносин важко концентруватися — де є психологічна підтримка?", "label": "Mental Health"},
  {"id": 33, "text": "Як оформити академзаборгованість, щоб її зняли перед випуском?", "label": "Administrative"},
  {"id": 34, "text": "Хто відповідає за бронювання аудиторій для студентських заходів?", "label": "General"},
  {"id": 35, "text": "Чи можна отримати додаткові бали за проект, якщо його допрацювати?", "label": "Homework"},
  {"id": 36, "text": "Почуваюся ізольованим у гуртожитку — немає друзів і важко заводити знайомства.", "label": "Mental Health"},
  {"id": 37, "text": "Куди подавати заявку на обмін студентами Erasmus?", "label": "Administrative"},
  {"id": 38, "text": "Хто може допомогти зі скануванням документів у деканаті?", "label": "General"},
  {"id": 39, "text": "Як розв'язати систему диференціальних рівнянь з початковими умовами?", "label": "Homework"},
  {"id": 40, "text": "Іноді у мене панічні атаки під час презентацій — чи проводяться тренінги з публічних виступів?", "label": "Mental Health"},
  {"id": 41, "text": "Як змінити контактні дані в особистому кабінеті студента?", "label": "Administrative"},
  {"id": 42, "text": "Чи є на факультеті кімната для тих, хто хоче попрацювати в тиші?", "label": "General"},
  {"id": 43, "text": "Поясніть, будь ласка, алгоритм жадібного сортування на прикладі.", "label": "Homework"},
  {"id": 44, "text": "Завжди прокидаюся з відчуттям, що не встигаю зробити все — як боротися з перфекціонізмом?", "label": "Mental Health"},
  {"id": 45, "text": "Коли виписують результати по практиці цього семестру?", "label": "Administrative"},
  {"id": 46, "text": "Чи можна підключитися до Wi-Fi гуртожитку без VPN?", "label": "General"},
  {"id": 47, "text": "Які файли потрібно прикріпити до курсового проекту?", "label": "Homework"},
  {"id": 48, "text": "Почуваюся пригніченим після провалу іспиту — як повернути впевненість?", "label": "Mental Health"},
  {"id": 49, "text": "Як отримати копію академічної довідки за попередній рік?", "label": "Administrative"},
  {"id": 50, "text": "В кого можна взяти інструменти для майстерні на день?", "label": "General"},
  {"id": 51, "text": "Чи можна перезалікувати лабораторну, якщо результати були втрачені через збій ПК?", "label": "Homework"},
  {"id": 52, "text": "Я відчуваю постійний стрес через фінансові проблеми — куди звернутися по консультацію?", "label": "Mental Health"},
  {"id": 53, "text": "Де подивитися розклад екзаменів і кімнати їх проведення?", "label": "Administrative"},
  {"id": 54, "text": "Чи буде трансфер для студентів на конференцію за містом?", "label": "General"},
  {"id": 55, "text": "Поясніть, будь ласка, як працює регулярний вираз для валідації email.", "label": "Homework"},
  {"id": 56, "text": "Мені здається, я перенавантажений — часто зриваю дедлайни і хочу поговорити з кимось.", "label": "Mental Health"},
  {"id": 57, "text": "Яким чином можна подати апеляцію на оцінку?", "label": "Administrative"},
  {"id": 58, "text": "Де в кампусі знайти зарядні станції для ноутбуків?", "label": "General"},
  {"id": 59, "text": "Як доказати лінійну залежність векторів у задачі з алгебри?", "label": "Homework"},
  {"id": 60, "text": "Після переїзду до іншого міста я відчуваю сильну самотність — є групи підтримки?", "label": "Mental Health"},
  {"id": 61, "text": "Чи потрібно реєструватись на консультації у викладача перед візитом?", "label": "Administrative"},
  {"id": 62, "text": "Хто відповідає за оновлення інформації на сайті факультету?", "label": "General"},
  {"id": 63, "text": "Можна отримати приклади розв'язків задачі з теорії графів?", "label": "Homework"},
  {"id": 64, "text": "Втрачаю апетит і інтерес до хобі — не знаю, що робити.", "label": "Mental Health"},
  {"id": 65, "text": "Як оформити відрахування з університету за власним бажанням?", "label": "Administrative"},
  {"id": 66, "text": "Чи проводяться заняття офлайн під час святкового тижня?", "label": "General"},
  {"id": 67, "text": "Чи потрібно вказувати версію Python у звіті по практиці?", "label": "Homework"},
  {"id": 68, "text": "Я боюся помилок у доповідях перед великою аудиторією — як подолати страх?", "label": "Mental Health"},
  {"id": 69, "text": "Куди звертатися, якщо втратив студентський квиток?", "label": "Administrative"},
  {"id": 70, "text": "Чи можна принести домашнього улюбленця на День відкритих дверей?", "label": "General"},
  {"id": 71, "text": "Підкажіть, як оптимізувати цей SQL-запит по швидкодії.", "label": "Homework"},
  {"id": 72, "text": "Маю проблеми з концентрацією через шум у гуртожитку — куди скаржитись?", "label": "Mental Health"},
  {"id": 73, "text": "Як змінити напрям підготовки в межах факультету?", "label": "Administrative"},
  {"id": 74, "text": "Чи буде повторне проведення курсу для тих, хто пропустив через хворобу?", "label": "General"},
  {"id": 75, "text": "Поясніть, як побудувати графік залежності y=f(x) в matplotlib.", "label": "Homework"},
  {"id": 76, "text": "Я відчуваю себе вигоранням після кількох семестрів інтенсивного навчання.", "label": "Mental Health"},
  {"id": 77, "text": "Де отримати інформацію про працевлаштування після випуску?", "label": "Administrative"},
  {"id": 78, "text": "Хто організовує волонтерські ініціативи від факультету?", "label": "General"},
  {"id": 79, "text": "Як розв'язати задачу на ймовірності з умовними подіями?", "label": "Homework"},
  {"id": 80, "text": "Мене часто мучить безсоння перед іспитами — як це побороти?", "label": "Mental Health"},
  {"id": 81, "text": "Чи є можливість отримати відстрочку по оплаті через скрутну фінансову ситуацію?", "label": "Administrative"},
  {"id": 82, "text": "Де знайти контакт старост групи на цей семестр?", "label": "General"},
  {"id": 83, "text": "Потрібна порада: як оформити графічну частину проекту для захисту?", "label": "Homework"},
  {"id": 84, "text": "Після критики наставника я відчуваю себе недостойним — як підвищити самооцінку?", "label": "Mental Health"},
  {"id": 85, "text": "Які правила проживання в гуртожитку стосовно гостей?", "label": "Administrative"},
  {"id": 86, "text": "Чи є в університеті кімната для молитви чи медитації?", "label": "General"},
  {"id": 87, "text": "Як оцінити похибку вимірювання у лабораторній роботі?", "label": "Homework"},
  {"id": 88, "text": "Іноді думаю, що краще все покинути — це не вихід, але я потребую допомоги.", "label": "Mental Health"},
  {"id": 89, "text": "Куди звертатися за довідкою для проїзду в громадському транспорті?", "label": "Administrative"},
  {"id": 90, "text": "Чи можна знімати лекції на телефон під час занять?", "label": "General"},
  {"id": 91, "text": "Поясніть, як застосувати метод перебору для розв'язання комбінаторної задачі.", "label": "Homework"},
  {"id": 92, "text": "Я відчуваю себе емоційно виснаженим через конфлікт в групі.", "label": "Mental Health"},
  {"id": 93, "text": "Як оформити запит на копію е-лікарняного для деканату?", "label": "Administrative"},
  {"id": 94, "text": "Хто відповідає за організацію спортивних секцій на факультеті?", "label": "General"},
  {"id": 95, "text": "Чи потрібно коментувати кожну функцію в коді для захисту проекту?", "label": "Homework"},
  {"id": 96, "text": "Маю нав'язливі думки і не можу сконцентруватися — де можна отримати екстрену психологічну консультацію?", "label": "Mental Health"},
  {"id": 97, "text": "Як отримати підпис куратора на формі проходження практики?", "label": "Administrative"},
  {"id": 98, "text": "Чи можна здавати роботи у форматі PDF чи потрібен docx?", "label": "General"},
  {"id": 99, "text": "Підкажіть, будь ласка, як реалізувати рекурсивну функцію для обходу дерева.", "label": "Homework"},
  {"id": 100, "text": "Відчуваю, що моє навчання стало безглуздим і хочу поговорити з психологом.", "label": "Mental Health"}
]
